{
  "PILOT": [
    {
      "port": 8086,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "报表工具",
      "display_name_en": "Pilot",
      "description": "基于Web的报表展现工具。轻量且灵活，支持多维度的分析和自助分析，提供二十余种报表样式，对时序数据有很好的展现。",
      "description_en": "Pilot is a web-based data visualization service focusing on business intelligence reporting. It contains the drag and drop environment for data analysis, and there are more than 20 kinds of graphical charts embedded in the product. Different from other BI tools, it provides extreme interactive analysis and visualization capabilities on big data through a distributed analysis engine. Many data sources are supported, including Transwarp Inceptor, MySQL and other RDBMS."
    }
  ],

  "NOTEBOOK": [
    {
      "port": 8686,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "数据分析交互平台",
      "display_name_en": "Zeppelin",
      "description": "轻量的科学计算开发工具。支持使用R、Scala和SQL做数据分析，提供方便的交互界面，可实现数据清洗、机器学习等任务并可以团队协作处理。",
      "description_en": "Web-based notebook that enables data-driven, interactive data analytics and collaborative documents with SQL, Scala, Python and more. Some charts are already included in notebook for data visualization. It contains interpreters for Transwarp Discover and Spark so that data scientists can analysis big data easily."
    }
  ],

  "WORKFLOW": [
    {
      "port": 9091,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "工作流",
      "display_name_en": "Workflow",
      "description": "图形化的工作流设计、调试、调度和分析的服务平台。支持Shell、SQL、JDBC、HTTP等任务类型，支持自定义Java任务。提供丰富的分析展现形式协助诊断工作流的执行状况。",
      "description_en": "The web-based tool to design, debug, schedule the job processes and tasks flow. Tasks written in shell, SQL, JDBC and HTTP are supported, and user-defined Java tasks can also be scheduled on big data platform. It provides good analysis capabilities for all scheduled jobs so that tuning tasks are easy, besides good security control are included."
    }
  ],

  "RUBIK": [
    {
      "port": 32125,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "Cube设计工具",
      "display_name_en": "Rubik ",
      "description": "OLAP Cube的可视化设计工具，用于设计OLAP模型并支持实例化，提供雪花模型和星形模型两种模型，并支持多种格式的数据源，可用于加速多维度数据分析。",
      "description_en": "Rubik is a visualized tool to design OLAP Cubes for big data. Both snowflake and star model are supported when designing models, and various data sources including HDFS and remote RDBMS can be used for cube building. With the acceleration of Cube, analytical query can speed up by 10x and give data analysts better interactive experience."
    }
  ],

  "GOVERNOR": [
    {
      "port": 21000,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "数据治理",
      "display_name_en": "Governor",
      "description": "元数据管理工具，可用于收集、展现和管理元数据，监控数据和程序的更改历史，进行数据血缘分析和影响分析，调试数据问题，追踪问题来源。",
      "description_en": "Governor is a web-based metadata management and data governance tool. It gives user approaches to manage metadata including tables and SQL procedures, monitors all the data and program changing history, analyzes data lineage, and performs impact analysis. Developers can use this tool to debug data problems and root cause issues, and also to analyze what will be impacted before any meta change occurs. Governor aims to aid users improve the data quality for big data."
    }
  ],

  "TRANSPORTER": [
    {
      "port": 20000,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "ETL工具",
      "display_name_en": "Transporter",
      "description": "设计和创建ETL任务的可视化工具，支持从RDBMS到TDH的近实时数据同步。Transporter提供完整的数据整合功能，支持多种格式的数据源和丰富的导出格式，以及多种常用的数据转换操作。",
      "description_en": "Transporter is a web-based tool for designing and building ETL jobs for TDH. It offers near real-time data synchronization feature from RDBMS to TDH so that users can migrate the data analysis work from RDBMS to Hadoop for analytics and mining; various data sources including CSV, JDBC, XML, JSON, RDBMS are supported, and Transporter are equipped with frequently used transformers like joining, aggregation, data cleansing and etc. All the data processing jobs generated by Transporter are done in Inceptor with full ACID support."
    }
  ],

  "GUARDIAN": [
    {
      "port": 8380,
      "protocol": "HTTPS",
      "require_gateway_registration": false,
      "display_name": "安全与权限",
      "display_name_en": "Guardian",
      "description": "统一的安全和资源管理服务平台，Guardian支持Kerberos和LDAP认证，实现租户级别的资源管理，可以做细粒度的权限控制，为整个集群系统加强安全防护。",
      "description_en": "Guardian is a centralized security and resource management service in TDH. It supports both LDAP and Kerberos to make sure clusters are immune to attacks and security threats. The multi-tenant resource management module controls all the user and resource data, with a graphical tool to set the user privileges and resources quotas."
    }
  ],

  "MILANO": [
    {
      "port": -1,
      "protocol": "HTTP",
      "require_gateway_registration": false,
      "path": "/",
      "display_name": "日志服务",
      "display_name_en": "Milano",
      "description": "日志诊断和检索平台，负责收集TDH和TOS中各个服务的日志，提供图形化的诊断和日志检索功能，方便系统运维和故障诊断。",
      "description_en": "Milano is the platform for log collection, analyzing, diagnosing and search, and all application logs in Transwarp Cloud are assembled by it. Operating uses can use a web tool to search and analysis logs for issue identifying and root causing, and they can also set up alerts or notifications when necessary."
    }
  ],

  "INCEPTOR": [
    {
      "port": 4040,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "alias": "INCEPTOR",
      "path": "/jobs",
      "display_name": "Inceptor UI",
      "display_name_en": "Inceptor UI",
      "description": "Inceptor任务监控页面，提供各应用运行状态、Holodesk资源使用情况、环境和Executor信息。",
      "description_en": "Inceptor UI is the web tool for Inceptor job & tasks monitoring. It provides fine granularity statistics for each SQL task, including latency, resource consumption, IO costs, so developers can use it for performance tuning and problem diagnosing."
    },
    {
      "port": 10000,
      "require_gateway_registration": false,
      "alias": "HiveServer2"
    }
  ],

  "SEARCH": [
    {
      "port": 9200,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "display_name": "ES管理器",
      "display_name_en": "ES Head",
      "description": "Elastic Search的网页版本的集群管理工具，支持数据的增删改查，并且可以通过语句进行可视化查询，是ES开发人员的一个非常有用的辅助工具。",
      "description_en": "ES Head is a web-based tool for Elastic Search cluster management, on-line query, data visualization, and CRUD operations. It is widely used by ES users for cluster operating and application development."
    }
  ],

  "TERMINAL": [
    {
      "port": 5000,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "命令行终端",
      "display_name_en": "Terminal",
      "description": "网页版的操作命令行工具，集成了可以操作Transwarp所有服务的命令以及环境设置，因此从这个工具进入，可以非常方便的做各种运维操作以及大数据开发工作。",
      "description_en": "A web based console with all utilities for Transwarp big data development and operation assembled, so it provides full capabilities as a console into a remote machine which has all developing environment set up."
    }
  ],

  "HYPERBASE": [
    {
      "port": 60010,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "display_name": "HyperBase管理",
      "display_name_en": "HyperBase Master",
      "description": "HyperBase管理页面方便运维人员有效的了解当前HyperBase集群的运行状况，包括基本的配置，HDFS和Zookeeper相关的信息，集群的负载情况，表和region的分布情况，以及split key等。",
      "description_en": "The HyperBase Master UI is a useful tool to get an overview of the current status of the cluster. From its page, you can get the version of the running HyperBase, its basic configuration, including the root HDFS path and ZooKeeper quorum, load average of the cluster, and a table, region, and region server list."
    }
  ],

  "HDFS": [
    {
      "port": 50070,
      "protocol": "HTTP",
      "require_gateway_registration": true,
      "path": "/",
      "display_name": "HDFS管理",
      "display_name_en": "HDFS Namenode UI",
      "description": "HDFS管理服务用于HDFS的基本信息的查询，能够列出所有的HDFS datanode的基本信息，以及当前服务的一些运行统计数据；此外，如果有权限，它还可以浏览HDFS的所有文件。",
      "description_en": "It lists the DataNodes in the cluster and basic statistics of the cluster. The web interface can also be used to browse the file system with permission."
    }
  ]
}